
const postList = [
  {
    "classificaion": "공지사항",
    "no": 4,
    "writer": "관리자",
    "title": "더치트 사용 방법",
    "content": "더치트(The cheat)는 중고 거래 사기를 예방하기 위해 제공하는 사이트입니다.\n\n중고 거래를 하기 전에 더치트 사이트에서 거래하는 사람의 연락처나 계좌번호를 조회한 다음 거래를 하시는 것을 추천드립니다.\n\n더치트 사이트에 접속하여 메인 화면의 검색창에 조회하고 싶은 연락처 또는 계좌번호를 검색하면 해당하는 사용자의 피해 사례 검색 결과가 나오게 됩니다.\n\n또한 사기를 당했을 때에 피해 대응에 대한 방법 & 상담 서비스 또한 존재하며, 사기꾼이 검거가 되었는지도 확인할 수 있습니다.\n\n중고거래를 하기 전, 이슈 페이지에 존재하는 더치트 링크를 통해 사용하신다면 중고 거래를 더 안전하게 하실 수 있게 됩니다.",
    "createDate": "2022-06-09",
    "link": "/img/TheCheat.png",
  },
  {
    "classificaion": "공지사항",
    "no": 3,
    "writer": "관리자",
    "title": "중고 거래 사기 예방 방법",
    "content": "다음중 3가지 이상 해당된다면 사기꾼을 가능성이 높습니다!\n\n\n1. 거래 내역이 없거나 최근 며칠 이내 뿐이다.(커뮤니티라면 활동 내역 참고)\n\n2. 전화번호가 없고 카카오톡 등 메신저로 연락을 유도한다.\n\n3. 어디서 직거래가 가능한지 지역이 없거나 택배 거래만을 요구한다.\n\n4. 시세보다 20~30% 이상 저렴하다.\n\n5. 선불 폰이다.\n\n6. 가상 계좌이다.\n\n7. (커뮤니티일 경우) 아이디 실명과 예금주의 이름이 일치하지 않는다.\n\n8. 구매자와 입금자의 실명이 일치하지 않는다.\n\n\n\n\n다음의 경우는 하나라도 해당되면 명백하게 사기꾼이다.\n\n\n1. 사기꾼 조회 사이트(더치트, 노스캠, 경찰청 사이버안전국) 검색에서 이름, 계좌, 전화번호로 사기 신고 내역이 조회된다.\n\n2. 판매자가 결제하라고 보내준 안전거래 사이트가 네이버에서 검색을 통해 찾아봐도 나오지 않는다.\n\n3. 네이버페이 안전결제 시 예금주가 '네이버페이'가 아니다.\n\n4. 인증사진이 퍼온 사진이다.\n\n5. 도용된 계정이다.\n\n6. 환불을 요구할때나 가격의 단위가 맞지 않아 출금이 안 된다는 등의 이유를 대며 2번, 3번 재차 입금을 요구한다.\n\n7. 수수료 또는 기타 이유로 재차 입금을 요구한다.",
    "createDate": "2022-06-03",

  },
  {
    "classificaion": "공지사항",
    "no": 2,
    "writer": "관리자",
    "title": "중고 거래 하는 방법",
    "content": "중고 거래 이용 방법은 다음과 같습니다.\n\n판매자는 판매 품목을 게시하고, 구매자는 구매 의향을 제시하면서 거래가 이루어집니다.\n\n거래는 여러 가지 형태로 이루어질 수 있는데 직거래로 받을 수도 있고, 택배로도 받을 수 있습니다.\n\n중고 거래에는 사기 사건도 하루에 몇 십 건씩 올라올 정도로 꽤나 많습니다.\n\n이는 리셀뷰어의 이슈페이지를 통해 꼼꼼히 살펴보고 신중히 구매하셔야 합니다.\n\n또한 이슈페이지에서 제공하는 더치트 링크를 통해 상대의 전화번호나 입금계좌번호를 조회해 보세요.\n\n더치트에서는 사기꾼 조회 및 피혜 사례들이 등록되어 있고, 피해에 대응하는 방법 또한 안내해 줍니다.\n\n사고 싶은 물건을 싸게 살 수 있고, 팔고 싶은 물건을 판매할 수도 있지만 거래를 하는데 있어서 신중함을 가져야 안전한 거래가 이루어질 수 있을 것입니다.",
    "createDate": "2022-05-24",
  },
  {
    "classificaion": "공지사항",
    "no": 1,
    "writer": "관리자",
    "title": "리셀뷰어(Resell Viewer)는 어떤 사이트인가요?",
    "content": "리셀뷰어(Resell Viewer)는 각 플랫폼(중고나라, 번개장터, 당근 마켓)의 중고 매물을 조회하여 직접 가격을 비교하며 중고 상품을 구매할 수 있는 사이트입니다.\n\n리셀뷰어(Resell Viewer)의 차트 페이지를 통해 구매자는 각 플랫폼의 최근 1주일 시세 데이터를 확인할 수 있습니다.\n\n또한 마켓 페이지를 통해 한 번의 검색으로 각 플랫폼에 등록되어 있는 중고 상품을 조회할 수 있습니다.\n\n거래하기 전 이슈 페이지에 존재하는 중고거래 사기에 대한 뉴스, 더치트 링크를 통해 사기를 예방할 수 있습니다.",
    "createDate": "2022-05-20",
    "link": "/img/ResellViewer.png",
  },
];

const getPostByNo = no => {
  const array = postList.filter(x => x.no == no);
  if (array.length == 1) {
    return array[0];
  }
  return null;
}

export {
  postList,
  getPostByNo
};